app/views/users/_unmentor.html.erb

<%= form_for current_user.mentorships.find_by_mentor_id(@person),
					:html => { :method => :delete },
					:remote => true do |f| %>
---
SELECT "mentorships".* FROM "mentorships" WHERE "mentorships"."mentor_id" = 12 AND ("mentorships".mentee_id = 1) LIMIT 1