app/controllers/pages_controller.rb

SELECT "works".* FROM "works" WHERE ("works".person_id = 10) ORDER BY works.age ASC
---
  def home
    @title = "ShapeSeed"
    @search = Search.new
    @work_results = Person.all.shuffle.
    						   map{|person| person.works[rand(person.works.length)]}.
    						   reject{|item| item.nil?}