app/controllers/people_controller.rb

SELECT "works".* FROM "works" WHERE ("works".person_id = 12) ORDER BY works.age ASC
SELECT "tags".* FROM "tags" WHERE ("tags".work_id = 14) ORDER BY tags.name ASC
SELECT DISTINCT "tags".* FROM "tags" INNER JOIN "works" ON "tags".work_id = "works".id WHERE (("works".person_id = 12)) ORDER BY tags.name ASC
---
  def show
    @person = Person.find(params[:id])
    @timeline_works_js = @person.works.reject{|work| work.blank?}
    @user = current_user
    @search = Search.new
    #@works = @person.works.paginate(:page => params[:page])
    @signed_bool = true unless !@user
    @timeline_tags_js = @person.works.collect{|work| work.tags.map(&:name).join(" ")}
    @tl_length = @timeline_works_js.length
    @tags = @person.get_unique_tags(@person)
    @work = Work.new
    @title = "#{@person.first} #{@person.last}"