app/controllers/works_controller.rb

INSERT INTO "works" ("content", "person_id", "created_at", "updated_at", "age", "name", "source", "contributor_id") VALUES ('Daffy Pernell (chemistry) and Frank Grundy (math) were both teachers who were just bubbling over with enthusiasm that really radiated their passion. Franky would propose a problem, "Okay, Work this out for N=2." Then he would think out loud, "Is that true for all N?" or "Is there a better, quicker, way of doing this?" Passion was the main thing that both of these role models exhibited.', 12, '2011-07-29 11:01:31.365512', '2011-07-29 11:01:31.365512', 15, 'High School Teachers', 'http://achievement.org/autodoc/page/ber1int-3', 1)
---
  def create
    @person = Person.find(params[:work][:person_id])
    @work = @person.works.build(params[:work])
    if @work.save